## **[MySQL OR operator](https://www.mysqltutorial.org/mysql-or/)**

Use the MySQL OR operator to combine Boolean expressions.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL OR operator

In [3]:
pd.read_sql('SELECT 1 OR 1, 1 OR 0, 0 OR 1, 0 OR 0;', engine)

   1 OR 1  1 OR 0  0 OR 1  0 OR 0
0       1       1       1       0

In [4]:
pd.read_sql('SELECT 1 OR NULL, 0 OR NULL, NULL OR NULL;', engine)

   1 OR NULL 0 OR NULL NULL OR NULL
0          1      None         None

### MySQL OR operator and short-circuit evaluation

MySQL won't evaluate the `1/0` expression.

In [5]:
pd.read_sql('select 1 = 1 or 1 / 0;', engine)

   1 = 1 or 1 / 0
0               1

### Operator precedence

`AND`'s precedence > `OR`'s precedence:

In [6]:
pd.read_sql('select 1 or 0 and 0;', engine)

   1 or 0 and 0
0             1

In [7]:
pd.read_sql('select (1 or 0) and 0;', engine)

   (1 or 0) and 0
0               0

### MySQL OR operator examples

In [8]:
string = '''
SELECT customerName, country
FROM customers
WHERE country = 'USA' OR country = 'France';
'''

df1 = pd.read_sql(string, engine)

In [9]:
df2 = (
    pd.read_sql_table('customers', engine)
    .query("country == 'USA' or country == 'France'")
    [['customerName', 'country']]
    .reset_index(drop=True)
)

In [10]:
df1.equals(df2)

True

In [11]:
df1.head()

                   customerName country
0             Atelier graphique  France
1            Signal Gift Stores     USA
2             La Rochelle Gifts  France
3  Mini Gifts Distributors Ltd.     USA
4               Mini Wheels Co.     USA

In [12]:
string = '''
SELECT customerName, country, creditLimit
FROM customers
WHERE 
    (country = 'USA' OR country = 'France')
    AND creditLimit > 100000;
'''

df1 = pd.read_sql(string, engine)

In [13]:
query = "(country == 'USA' or country == 'France') and creditLimit > 100000"

df2 = (
    pd.read_sql_table('customers', engine)
    .query(query)
    [['customerName', 'country', 'creditLimit']]
    .reset_index(drop=True)
)

In [14]:
df1.equals(df2)

True

In [15]:
df1.head()

                   customerName country  creditLimit
0             La Rochelle Gifts  France     118200.0
1  Mini Gifts Distributors Ltd.     USA     210500.0
2             Land of Toys Inc.     USA     114900.0
3        Saveley & Henriot, Co.  France     123900.0
4            Muscle Machine Inc     USA     138500.0